{"title":"2018带给我的东西","slug":"2018带给我的东西","date":"2018-12-29T03:32:26.000Z","updated":"2018-12-29T04:01:04.717Z","comments":true,"path":"api/articles/2018带给我的东西.json","photos":[],"link":"","excerpt":" [Figure] ","covers":["http://pjv3m7o5n.bkt.clouddn.com/18-12-29/73484381.jpg"],"content":"<p><img src=\"http://pjv3m7o5n.bkt.clouddn.com/18-12-29/73484381.jpg\" alt=\"\"></p>\n<blockquote>\n<p>当X=life，无论多简单的算式都没人能求出正确的解<br><a id=\"more\"></a></p>\n</blockquote>\n<p>2018与以往任何一年一样，年岁的增长并没有让我的生活有丝毫美好的转变，依然在终点不明的轨道上默默无闻、浑浑噩噩、孑然一身，硬要说2018对我的意义，就是这是我带着没卵用的学历踏入社会的第一年，也是我人生的第21个年头。<br>是的，仔细想想居然21岁了，时间这东西就像是每天都在掉的头发，平时没留意还好，一旦开始在意了就会被吓一跳……好吧，这是个烂比喻，但就是这么回事，正是因为这份惊吓，才开始让我有了想要搭建博客记录成长的想法，希望这能成为我持之以恒的习惯。<br>“持之以恒”这四个字看着简单甚至可以说听厌看厌了，但却是我二十一年以来一直学不会的东西；十三四岁我目前最冲动傻事蠢事干最多的时期，更别提当时一堆脑子一热做的弱智决定，那段不堪回首得时期绝对算得上我人生的黑历史污点，一回想起来就只想付钱给&lt;死侍2&gt;里的韦德让他借电索的腕表穿越回去把当时的自己给毙了……好像有点扯远了，同样因为这份冲动，让我当时直至后来六七年都有了不少想法，对于一些当时身边还称得上朋友甚至所谓“兄弟”的人，我把这些想法告诉了他们，对于一些人我则完全没有提起过。<br>其中最值得一提的想法就是写小说了，当时还算个爱看书的人，当然不爱看正经书，正值满脑子中二妄想的年纪，沉迷各种各样的网文小说，这个想法冒头仅仅只是因为当时写了篇作文被语文老师表扬了几句，当时成绩又差，就总想做些与众不同的事博取认可；就这样开始尝试写了一些，当时构思过各种小说类型，当然都是网文类的，玄幻，网游，受了当时网文风格的影响，后宫型的自然有，写了一些给身边的几个人看，评价也算还行就随便发上了小说站上；不过结果就是没坚持下来，太监了，当然最重要的原因是之后觉得这实在太蠢了……<br>这之后还有弹吉他和画画，不提也罢，该说这些不切实际的想法也算是犯傻的一部分。<br>小说动漫之类的看多了就总以为自己跟里面的主角一样是什么特别的存在，会有什么不凡的成就，但时间与现实总会让你认清自己，成长就是这么一回事，无论用多美好的语言修饰，生活始终不是一个浪漫的词汇。<br>我曾经很多次想过假如在过去的某个时间点如果做了不同选择或者勇敢踏出那一步的话如今会过着怎样的生活，可能会比现在更好，也可能会比现在更差；想想当时做这些选择的时候也是满心希望与热血，总觉得事情都会按照自己认为的方向发展，可到头来连自己都迷失了，也许我并不是个会做选择的人吧。<br>但到了这个该认真开始思考“生活究竟是什么？”的年纪，不会选择也要逼着自己去做选择，一个力所能及，决不后悔的选择。<br>想想这些年变了这么多，但却是第一次没任何人督促，完全自发认真地为自己做个年终总结，希望这之后每一年的年末都能给自己交一份满意的答卷。<br>目前的目标有两个，前端和写作；之前浅浅的接触了UI设计，总觉得靠着中专时打下的PR、AE、PS、AI的基础学习效率应该比较高，但学了有一阵子觉得学习效率还是太慢了就想着放弃试试看学前端，结果学习效率提升显著，但或许是因为网上说前端门槛低深入难的原因吧。<br> 上面提起过以前写过小说的事，虽然某种程度上我的确算是放弃这件事了，但我没法让我的脑袋停止幻想，那份创作欲无论浇灭了多少次都还是会重新燃起点点火光，所以，我想试着重新把这件事捡起来，至少能弥补心里的那份缺憾。<br>  以下这些话是对2019及之后的自己所说，望能自勉：<br>  无论要做什么，不妨先从规划好自己的时间开始<br>  成年人的世界没有容易二字，真下决心要去做好的话就坚持下去，别再做白日梦放纵自己犯懒了。<br>  这个世界就是这样，很多事你永远也比不上人家，别再被外界的虚华冲昏头脑，做好你自己。<br>  最后，趁一切都还来得及之前，尽全力去奔跑吧。<br><a href=\"http://pjv3m7o5n.bkt.clouddn.com/%E4%BA%94%E6%9C%88%E5%A4%A9%20-%20%E6%86%A8%E4%BA%BA.mp3\" target=\"_blank\" rel=\"noopener\"></a></p>\n","categories":[],"tags":[{"name":"年终","slug":"年终","count":1,"path":"api/tags/年终.json"}]}