{"title":"《平面设计完全手册》总结Part.1","slug":"平面设计完全手册Part-1","date":"2018-12-17T07:27:20.000Z","updated":"2018-12-17T07:33:17.789Z","comments":true,"path":"api/articles/平面设计完全手册Part-1.json","photos":[],"link":"","excerpt":"前言与设计原理<br>","covers":["http://pjv3m7o5n.bkt.clouddn.com/18-12-17/76608042.jpg"],"content":"<blockquote>\n<p>前言与设计原理<br><a id=\"more\"></a></p>\n</blockquote>\n<p><img src=\"http://pjv3m7o5n.bkt.clouddn.com/18-12-17/76608042.jpg\" alt=\"\"></p>\n<p>• 设计越不起眼、不被人意识到、隐藏在背景中，就越能凸显和强化它的功能和目的，从而也就越成功<br>• 艺术引导观赏者去绞尽脑汁，而设计免去了人们不必要的思考<br>• 形式服从于功能<br>• 每次设计至关重要的几点：生产这件产品的目的；这件产品要怎样发挥功能以达到这一目的；我们应该给这件产品怎样的形态来最大限度地支持它的功能；设计和生产的成本与产品的目的是否协调<br>• 学会睁大眼睛观察这个世界并问自己这种设计为什么会引起我的注意，这种设计最醒目最想要突出的突出的是什么，是什么原理让这件产品的设计如此激动人心或者对这种设计一点兴趣都没有<br>• 所有的设计法则从根本上都遵循着清晰的逻辑以及我们在工作中积累的经验。几乎没有哪一条法则是完全随意地产生的，实际上总有一个合适的理由能解释它为什么是这样的，为什么应当遵循它。<br>• 但我们不能盲目运用这些法则。你更需要做的是在设计中不时抽出5分钟时间来检查各个阶段的工作成果：这次是否理想地运用了这些法则？我们在这里是否考虑了这些法则的例外情况？<br>创意源于头脑，除了对整体布局要有创造性的想法，你还需要有独创性的灵感，并用自己的方法把想法变成现实。<br>    • 迪特尔拉姆斯的好设计十诫：<br>好设计是创新的。<br>好设计师是让产品被需要的。<br>好设计是美观的。<br>好设计让产品被理解。<br>好设计是谨慎谦虚的。<br>好设计是诚实的。<br>好设计是经久不衰的。<br>好设计是连贯的（即使在细枝末节处）。<br>好设计是环保的。<br>好设计应该尽量简洁。<br>    • 你的任务是设计，这不代表你可以按照自己的或者委托人的品味来工作。迎合目标群体的品味才是对产品起决定性作用的做法。<br>    • 设计是不可可观测量的，因为创造性工作没有绝对的标准去衡量哪个更好，使一种设计成为好设计的很多因素并不是客观的可测量物，而是存在于主观感受中的。<br>    • 一件设计对我们产生的影响也与大家平时积累的经验有关。对设计师来说更重要的是要明白，通过视觉手段的运用，我们可以将某样东西表现得复杂或简单，安静或活泼，醒目或低调。设计可以刺激人们在观察某物时产生稳定或不安的情绪。<br>    • 优秀的设计可以让使用者避免不必要的思考，实现其预期，并与其经验相符合。优秀的设计可以利用使用者的经验，通过视觉刺激对使用者的注意力加以引导（按照设计师的想法）。<br>    • 有用的并不一定美观，然而绝不能因为追求功能而忽略了美观性。<br>    • 精妙的设计应呈现和谐、对比、平衡。<br>    和谐与对比（p14-15）——优秀的设计师可以在和谐与对比间找到平衡，同时又能将功能和美观性统一起来。<br>        • 和谐：如果一个版面能给读者以井井有条的感觉，那它就创造了和谐，也就是说，所有的元素都在它该在的位置，元素间有清晰的相互关系，图片和正文的边界形成主线。当然，并非只有整齐的主线能创造设计的和谐感。通过选取相互协调的颜色空间、图片及字体，也可以营造设计的和谐感。<br>        • 对比：过多的和谐会使设计显得乏味。与整体的秩序、元素间的相互协调同样重要的是反差与对比，它们可以制造变化。图像、照片、图形元素及文本元素的大小要么相同（即相互和谐），要么形成鲜明对比。对比除了体现在设计元素和字符的大小上，还反映在颜色搭配和图片选择等方面。<br>    越少及越多(p15)——“越少及越多”“减到最少”“保持简单、直接”<br>    设计和其中的信息都要“在点子上”，所有与核心的要求、信息以及任务无关的都应该略去。你要关注的是最本质的东西。如果你在设计中使用了过多元素，作品的效果就会大打折扣。因为它没有明确的焦点，也就没法留住观众。<br>    接近律(p16)——距离相近的物体是作为一个整体看待的。<br>    相比在形状或者颜色上的一致，在位置上的接近有更大的作用。<br>    连续律(p16)——沿着某一平直或曲折的线排列的元素比那些不在同一条线上的元素看起来更具整体性。<br>    我们让这些单个的线条以某种规律相互关联起来：有时候这些元素整齐地排列在一条清晰可辨的线上，还有些时候我们可以从线条之间的距离以及它们的长短关系中观察到某种周期性的规律。<br>    完整律(p17)——人们在观察事物的时候总是希望发现一些规律。在这种心理的强烈作用下我们甚至能发现原本不存在的互相关联的图形。<br>    我们在观察事物时总是下意识地去关注那些实际上没有看到的东西——有可能是本不存在的正方形和菱形，也有可能时将其他字母抠掉一部分之后才会出现的字母。我们的观察要把彼此关联的单个元素结合起来，使其成为完整的新图形——我们在平面上观察到的各种形象。这些形象也可以被看成是觉的框架或者窗户。<br>    相似律(p18)——形状相同的物体和大小相同的物体也会被当作整体来看待。<br>    造成这些物体之间具有明显相关性不仅是因为他们大小相同、其协调的位置也有影响（连续律）。相似律在颜色相同的情况下作用最显著，颜色的一致比其他形式的一致更具优势。<br>    干扰效应(p18)——干扰效应指在同意图像中出现两种相互对立的表达，这会刺激观赏者。<br>    希克斯定律、KISS法则(p19)——根据希克斯定律，一个人面临的选择越多，他做出某一决定所需的时间就越长。传达的图像及内容信息要集中在一点上，“越少及越多”。优秀的设计师应该始终保持简单明了。<br>    可靠性(p19)——大多数消费者更多地用眼睛 去挑选商品，凭感觉做出决定，你做的设计一定要符合产品的定位。<br>    部分的总和(p20)——如果不关注最精微的细节，设计师就不能做出美观的设计。<br>    整体是各个部分的总和。但如果各个部分能够相互协调，那么整体就远远大于总和了。 </p>\n","categories":[],"tags":[{"name":"笔记","slug":"笔记","count":1,"path":"api/tags/笔记.json"}]}