{"title":"碧血的救赎诗篇——《荒野大镖客：救赎2》","slug":"碧血的救赎诗篇——《荒野大镖客：救赎2》","date":"2019-01-25T10:26:38.000Z","updated":"2019-01-25T10:47:24.960Z","comments":true,"path":"api/articles/碧血的救赎诗篇——《荒野大镖客：救赎2》.json","photos":[],"link":"","excerpt":" [Figure] ","covers":["https://ws4.sinaimg.cn/large/005R3hwagy1fzj0ac49ycj32yo1o0n5f.jpg","https://ws4.sinaimg.cn/large/005R3hwagy1fzj0dljy0gj32yo1o01kx.jpg"],"content":"<p><img src=\"https://ws4.sinaimg.cn/large/005R3hwagy1fzj0ac49ycj32yo1o0n5f.jpg\" alt=\"\"></p>\n<blockquote>\n<p>May I stand unshaken? Amid, amidst a crashing world<br><a id=\"more\"></a></p>\n</blockquote>\n<p>旧时代落幕与新秩序建立这段时期那些命运漂泊者的挣扎与抗争一直是我心里排名前五的浪漫故事，身处其中的人们总是要做出各种身不由己的残酷抉择，或为情义或为善恶，而无论作何抉择都只会导致不好的结局，那种即使明知以命相搏也改变不了什么却坚定地一往无前的悲剧英雄实在是很帅。<br>好像有点扯远了，但《荒野大镖客》的故事正是发生在这种时期，几乎持续了一个世纪的西进运动渐渐进入尾声，同时蛮荒地带上轰鸣的工业机器也宣告着美国野蛮时代的尾声，无论是穷乡僻壤的小镇还是灯红酒绿的大都会都讲究起法治。<br><img src=\"https://ws4.sinaimg.cn/large/005R3hwagy1fzj0dljy0gj32yo1o01kx.jpg\" alt=\"\"><br>但一路靠着枪与血拼过来的大老粗范德林帮可忍不了这个越来越文明的世界，对于老大德奇而言，文明是虚伪与腐败的代名词，大城市里尽是被金钱欲望迷惑、上流人士压榨的人；这可不是他想要过的生活，也不是范德林帮想要的生活。<br>虽然都是不法之徒，但他们不认为自己是跟其他帮派一样的罪犯，他们专挑资本家和富人作为抢劫的目标，也会救济受到其他帮派毒手的可怜人；在一次黑水镇的行动中，他们失败了，只好先逃到雪山上暂避风头。<br>在捉住了敌对帮派奥德里斯科帮的基兰之后得知奥德里斯科帮正在策划劫持一通火车，那是大商人康禾的运输火车，上面有着他的债券；现在地图和炸药都在他们的手上，于是德奇决定不如他们自己来抢。<br>虽然过程不太顺利，但最终还是把债券抢到手，但震怒的康禾也因此雇佣了平克顿找他们，接下来的故事就是围绕着他们不停躲避着平克顿和警察的追击和德奇干完最后一票大的就找个地方隐居过上田园牧歌生活的“计划”展开。<br><img src=\"https://ws2.sinaimg.cn/large/005R3hwagy1fzj0fae1q0j32yo1o0nk7.jpg\" alt=\"\"><br>“救赎”是整个故事的主题，玩家要自己探寻究竟是经历了什么事才让一个亡命之徒来救赎自己，而这个救赎也需要玩家来完成。<br>游戏里有个衡量玩家的荣誉值系统，玩家在游戏里的大多数行为都会影响到荣誉值：帮被蛇咬伤的路人吸出他的蛇毒，帮马匹失控的路人带回他的马或者顺马死掉的路人一程，帮没子弹的猎人打死野兽或者帮误踩捕兽夹的猎人解除捕兽夹的陷阱，解救被其他帮派绑架的执法人员或者解救被其他帮派抢劫的火车乘客，在圣丹尼帮助被打劫的路人或施舍路边的乞丐等等一系列的随机小事件都能提高荣誉值；而掉荣誉值的方式就很多了，杀人越货抢劫之类的就不说了，最致命的是一些操作上的小失误都会导致荣誉值的掉落，像是刹不住马撞倒了人甚至街边的小狗，甚至是搜刮了不是你杀的陌生人尸体都会导致荣誉值的掉落。<br>说到这就不得不提一句这个游戏强到令人发指的细节，毫不夸张的说R星真的是创造了一个完整的西部世界；就不说你可以做的事和生态环境什么的了，给我印象最深的是在刚到圣丹尼时发现唐人街枪店后面有个铁门，用枪指着老板之后逼他带我去看看门后是什么，在得知那是一个黑赌场之后拿着枪失手打死了老板赶紧逃了出城躲警察，隔个一天之后去圣丹尼的邮政局交了悬赏金之后想再回枪店看一看，就刚入那个街区就已经听到了路人用纯正的粤语说着“果日晚黑有人比枪打死左啊”“哇，得人惊”，虽然这之后走进枪店还是那个老板……<br>说回荣誉值系统，高荣誉值除了能够商店买东西打折和路人会对你更友善之外，也会对游戏的结局产生影响，这也是“救赎”的关键；我前期通过打招呼在营地干杂活还有当赏金猎人就已经攒了不少的荣誉值，所以在一些关键支线的选择就直接能把荣誉值升一级。<br>而R星是鼓励玩家去做好事的，在救下一些路人后他们会让你去商店随便挑些什么东西记到他账上，除此之外其他一些好事的奖励是要比做坏事是要来的多。<br><img src=\"https://wx3.sinaimg.cn/large/005R3hwagy1fzj0i3etlpj32yo1o07lj.jpg\" alt=\"\"><br>但好心未必会有好报，在野外路边求救的除了真正的可怜人还有那些专门利用同情心想抢你一把的劫匪，我已经遇见过无数次了，那些还好，毕竟还能自己操作手里有枪，最让我气不过的还是在圣丹尼，当时想按网上的彩蛋攻略抓吸血鬼，晚上到了暗巷那里时一个人在那喊着有挣钱的事做，既然是能挣钱的事自然就勾起了我的好奇心，抱着“就算是个套也不怕老子有枪”的侥幸心理就跟他进了个小巷子里，果然是个套，但没想到这里强行让你上套直接被后面几个人敲晕醒过来就被扔在了坟墓里没了一千多美金，看来无论是现实还是游戏，侥幸心理都要不得。<br><img src=\"https://wx2.sinaimg.cn/large/005R3hwagy1fzj0jjsh0xj32yo1o04hy.jpg\" alt=\"\"><br>荣誉值高的结局是鹿结局，反之则是狼结局，在后期的主线里已经可以通过亚瑟的梦来预见结局，当然，靠着后期的主线和关键支线还是可以拉一波荣誉值的。<br>接下来说说范德林帮里给我印象比较好的几个其他角色吧。<br>先是何西亚，这个满头白发的瘦老头总给人一种老狐狸的感觉，实际上也的确如此，亚瑟是他跟德奇一起带大的，坑蒙拐骗样样都会，冷静和善，有他在的话达奇也算比较冷静。<br><img src=\"https://wx2.sinaimg.cn/large/005R3hwagy1fzj0oewsbpj32yo1o0hdt.jpg\" alt=\"\"><br>接着也是帮派里另一个老狐狸特洛里尼，跟他一起做的任务总是很有趣，像是他扮成经纪人拦住歌唱家的马车然后让亚瑟趁这个空挡偷掉车后厢上的珠宝还有豪华邮轮上的抢劫任务。<br><img src=\"https://wx3.sinaimg.cn/large/005R3hwagy1fzj0pi0koqj32yo1o0n9t.jpg\" alt=\"\"><br>最后就是查尔斯了，整个游戏最贴近美国政治正确的角色，黑人与印第安混血，在那个白人至上主义的时代查尔斯查尔斯的地位非常尴尬，他也坦言加入范德林帮是因为没有那么多的拘束；查尔斯一直是最正直冷静的角色，面对偷猎者直接开枪打死毫不含糊，如果亚瑟没有做好正确的事也会被他指责，在亚瑟死后查尔斯也会回去好好安葬亚瑟，真的是挑不出毛病的一个人。<br><img src=\"https://ws1.sinaimg.cn/large/005R3hwagy1fzj0rhfwkqj32yo1o07wh.jpg\" alt=\"\"><br>最让我心疼的角色应该是老酋长豪雨佛尔，这段剧情也是最让人难受的剧情之一，也是在这段剧情里亚瑟看清了德奇的本性；彻底失控的德奇想要再挑起印第安人与政府的战争来扰乱政府与平克顿的注意力好干“最后一票”，佛尔的儿子飞鹰弗莱斯成了德奇的牺牲品。<br>亚瑟一伙人也没有成功救出弗莱斯，相反因为德奇的漠视，弗莱斯牺牲了自己救了亚瑟一命。<br><img src=\"https://wx4.sinaimg.cn/large/005R3hwagy1fzj0suy4dsj32yo1o01kx.jpg\" alt=\"\"><br>成功救出阿比盖尔并让她和赛迪逃走之后亚瑟独自一个人跑回营地去这段是整个游戏最触动人的地方了，他从包里取出自己的破烂赌徒帽戴到头上，眼神从未如此坚定过。<br><img src=\"https://ws2.sinaimg.cn/large/005R3hwagy1fzj0tnqzmpj32yo1o0wng.jpg\" alt=\"\"><br>成功掩护约翰逃走之后，看着亚瑟面向晨曦安详地闭上双眼，玩家能真真切切地体会到救赎的感觉。<br><img src=\"https://wx4.sinaimg.cn/large/005R3hwagy1fzj0u5yz3rj32yo1o0dqx.jpg\" alt=\"\"><br>在亚瑟回去营地时的那首《That’s The Way It Is》伴随着不断涌现的回忆可以说是整个游戏最棒的音乐了，我想它的歌词也是R星对于玩家的祝福，就以此作为结束吧：<br>愿微风常伴你背后<br>好运在你手中<br>愿你打出一副好牌<br>一切都皆在你的掌控之中<br>就是这样<br>愿就是这样</p>\n","categories":[],"tags":[{"name":"游戏 随笔","slug":"游戏-随笔","count":1,"path":"api/tags/游戏-随笔.json"}]}